tutorials/compressible/rhoPimpleFoam/RAS/angledDuct/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2512                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    front
    {
        type            noSlip;
    }

    back
    {
        type            noSlip;
    }

    walls
    {
        type            noSlip;
    }

    porosityWall
    {
        type            slip;
        value           uniform (0 0 0);
    }

    inlet
    {
        type            flowRateInletVelocity;
        massFlowRate    constant 0.1;
        rhoInlet        1;          // estimate for initial rho
    }

    outlet
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
        inletValue      uniform (0 0 0);
    }
}


// ************************************************************************* //
